In [13]:
import pandas as pd 
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [14]:
df = df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [15]:
target = df.Survived
inputs = df.drop(['Survived'],axis='columns')

In [16]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(2)

   female  male
0       0     1
1       1     0

In [17]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [18]:
inputs = inputs.drop(['Sex'],axis='columns')
inputs.head(2)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0

In [19]:
# To check if there are any null values
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [24]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [26]:
inputs['Age'].isna().sum()

0

In [30]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(inputs,target,test_size=0.2)

In [31]:
len(x_train)

712

In [32]:
len(x_test)

179

In [33]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB() # used when data distribution is normal

In [34]:
model.fit(x_train,y_train)

GaussianNB()

In [35]:
model.score(x_test,y_test)

0.7988826815642458

In [36]:
x_test[:10]

     Pclass   Age     Fare  female  male
835       1  39.0  83.1583       1     0
635       2  28.0  13.0000       1     0
762       3  20.0   7.2292       0     1
799       3  30.0  24.1500       1     0
539       1  22.0  49.5000       1     0
2         3  26.0   7.9250       1     0
285       3  33.0   8.6625       0     1
261       3   3.0  31.3875       0     1
436       3  21.0  34.3750       1     0
668       3  43.0   8.0500       0     1

In [37]:
y_test[:10]

835    1
635    1
762    1
799    0
539    1
2      1
285    0
261    1
436    0
668    0
Name: Survived, dtype: int64

In [38]:
model.predict(x_test[:10])

array([1, 1, 0, 1, 1, 1, 0, 0, 1, 0], dtype=int64)

In [40]:
model.predict_proba(x_test[:10])

array([[9.58732709e-04, 9.99041267e-01],
       [2.94092414e-02, 9.70590759e-01],
       [9.89085023e-01, 1.09149766e-02],
       [6.07112521e-02, 9.39288748e-01],
       [4.26931549e-03, 9.95730685e-01],
       [5.90603555e-02, 9.40939645e-01],
       [9.91113416e-01, 8.88658426e-03],
       [9.78704777e-01, 2.12952235e-02],
       [4.59746603e-02, 9.54025340e-01],
       [9.91209427e-01, 8.79057308e-03]])